zoolander-api-master/app/controllers/api/v1/zoos_controller.rb

SELECT "zoos".* FROM "zoos"
---
  def index
    zoos = Zoo.all

INSERT INTO "zoos" ("name", "state", "facility", "created_at", "updated_at", "address") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["name", "qdaefwrgstdhy"], ["state", "ikyjnbtgvfr"], ["facility", "wdefgrth"], ["created_at", "2017-05-25 17:34:10.542572"], ["updated_at", "2017-05-25 17:34:10.542572"], ["address", "jybhtf"]]
---
  def create
    zoo = Zoo.create(zoo_params)